In [2]:
import pandas as pd
import numpy as np  

data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
revise_data = data.dropna()

revise_data

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
df_data = pd.DataFrame([[1, np.nan, 2], [2, 3, 5], [np.nan, 4, 6], [pd.NA, None, pd.NA]])

df_data

      0    1     2
0     1  NaN     2
1     2  3.0     5
2   NaN  4.0     6
3  <NA>  NaN  <NA>

In [15]:
df_data.dropna(axis = 'rows', how='all')

     0    1  2
0    1  NaN  2
1    2  3.0  5
2  NaN  4.0  6